{
  "0.1.0": {
    "en": "Initial release"
  },
  "0.1.1": {
    "en": "Increased refresh interval to a minimum of 60 minutes, due to repeatedly experiencing 429 errors"
  },
  "1.0.0": {
    "en": "Improved security by hiding sensitive information in logs. Enhanced login process with Tibber, including better error handling and messaging. Refined app and device initialization logs for clarity. Updated settings interface for a smoother user experience. Fixed an issue where Tibber login could hang, now with proper cancellation. Resolved a bug in the Polestar 2 driver initialization that could cause errors during pairing. Adjusted log messages to provide more accurate information during updates. Several optimizations and code clean-ups for better performance and stability."
  },
  "1.0.1": {
    "en": "Updated app image and driver icon"
  },
  "1.0.2": {
    "en": "Fixed driver icon"
  },
  "1.0.3": {
    "en": "Changed app description for a better user experience on the Homey app store. Also fixed a bug where you could add any electric car from your Tibber account. You can now only add Polestar cars."
  },
  "1.0.4": {
    "en": "Improved log messages during pairing"
  },
  "1.0.5": {
    "en": "Added donation links, because you are the greatest community! :)"
  },
  "1.0.6": {
    "en": "Added community forum link to the app metadata"
  },
  "1.0.7": {
    "en": "Changed support email, and added homepage to metadata"
  },
  "1.0.8": {
    "en": "Fixed the device becoming unavailable after an apparent API change from Tibber. This error should now be fully resolved."
  },
  "1.0.9": {
    "en": "Added new capability \"Charged at home this month\""
  },
  "2.0.0": {
    "en": "Added a new driver for enhanced Polestar vehicle integration."
  },
  "2.0.1": {
    "en": "Added theme toggle for trip info image"
  },
  "2.0.2": {
    "en": "Fixed a minor typo bug in the new driver"
  },
  "2.0.3": {
    "en": "Fixed a bug where the battery level could be read as above 100, which would result in errors"
  }
}
